Autodesk.Revit.DB.TransactWithCentralOptions.GetLockCallback
Gets the callback object that changes Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
Since:
2014

Autodesk.Revit.DB.TransactWithCentralOptions.SetLockCallback(Autodesk.Revit.DB.ICentralLockedCallback)
Sets or resets a callback object that would allow an external application to change Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.TransactWithCentralOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TransactWithCentralOptions.#ctor
Constructs a new TransactWithCentralOptions.
Since:
2014

Autodesk.Revit.DB.TransactWithCentralOptions
Options to customize Revit behavior when accessing the central model.
Since:
2014